defmodule Faker.Name.Ru.Female do
  import Faker, only: [sampler: 2]

  @moduledoc """
  Functions for female name data in Russian
  """

  @doc """
  Returns a complete name (may include a prefix)

  ## Examples

      iex> Faker.Name.Ru.Female.name()
      "Д-р. Нина Куликовская"
      iex> Faker.Name.Ru.Female.name()
      "Надежда Шевченко"
      iex> Faker.Name.Ru.Female.name()
      "София Федорова"
  """
  @spec name() :: String.t()
  def name, do: name(Faker.random_between(0, 9))
  defp name(0), do: "#{prefix()} #{first_name()} #{last_name()}"

  defp name(n) when is_integer(n) do
    "#{first_name()} #{last_name()}"
  end

  @doc """
  Returns a random first name

  ## Examples

      iex> Faker.Name.Ru.Female.first_name()
      "София"
      iex> Faker.Name.Ru.Female.first_name()
      "Елена"
      iex> Faker.Name.Ru.Female.first_name()
      "Нина"
      iex> Faker.Name.Ru.Female.first_name()
      "Мария"
  """
  @spec first_name() :: String.t()
  sampler(:first_name, [
    "София",
    "Софья",
    "Анастасия",
    "Дарья",
    "Дарина",
    "Мария",
    "Анна",
    "Виктория",
    "Полина",
    "Елизавета",
    "Екатерина",
    "Ксения",
    "Валерия",
    "Варвара",
    "Александра",
    "Вероника",
    "Арина",
    "Алиса",
    "Алина",
    "Милана",
    "Милена",
    "Маргарита",
    "Диана",
    "Ульяна",
    "Алёна",
    "Ангелина",
    "Анжелика",
    "Кристина",
    "Юлия",
    "Кира",
    "Ева",
    "Карина",
    "Василиса",
    "Ольга",
    "Татьяна",
    "Ирина",
    "Таисия",
    "Евгения",
    "Яна",
    "Вера",
    "Марина",
    "Елена",
    "Надежда",
    "Светлана",
    "Злата",
    "Олеся",
    "Наталья",
    "Наталия",
    "Эвелина",
    "Лилия",
    "Элина",
    "Виолетта",
    "Виола",
    "Нелли",
    "Мирослава",
    "Любовь",
    "Альбина",
    "Владислава",
    "Камилла",
    "Марианна",
    "Марьяна",
    "Ника",
    "Ярослава",
    "Валентина",
    "Эмилия",
    "Майя",
    "Эльвира",
    "Снежана",
    "Влада",
    "Каролина",
    "Лидия",
    "Виталина",
    "Нина",
    "Есения",
    "Оксана",
    "Аделина",
    "Ада",
    "Лада",
    "Амелия",
    "Элеонора",
    "Антонина",
    "Людмила",
    "Галина",
    "Тамара",
    "Алла",
    "Жанна",
    "Инна",
    "Лия",
    "Серафима",
    "Анфиса",
    "Евангелина",
    "Агата",
    "Лариса"
  ])

  @doc """
  Returns a random last name

  ## Examples

      iex> Faker.Name.Ru.Female.last_name()
      "Галицына"
      iex> Faker.Name.Ru.Female.last_name()
      "Стацевич"
      iex> Faker.Name.Ru.Female.last_name()
      "Сафарова"
      iex> Faker.Name.Ru.Female.last_name()
      "Куликовская"
  """
  @spec last_name() :: String.t()
  sampler(:last_name, [
    "Травникова",
    "Смирнова",
    "Генералова",
    "Игнатова",
    "Краснова",
    "Белова",
    "Маслова",
    "Марченко",
    "Карпова",
    "Поднебесная",
    "Кольцова",
    "Морозова",
    "Демидова",
    "Рубенцова",
    "Макарова",
    "Иванова",
    "Новак",
    "Максимчук",
    "Потапова",
    "Меньшова",
    "Тимошенко",
    "Малиновская",
    "Абрамова",
    "Кручинина",
    "Дарова",
    "Власова",
    "Ильина",
    "Маркова",
    "Островская",
    "Мищенко",
    "Васнецова",
    "Ларина",
    "Добровольская",
    "Сафарова",
    "Тимофеева",
    "Куликовская",
    "Преображенская",
    "Коновалова",
    "Руденко",
    "Волощук",
    "Шведова",
    "Коваль",
    "Анисимова",
    "Никитина",
    "Преснякова",
    "Владова",
    "Прохорова",
    "Орловская",
    "Химченко",
    "Аркадьева",
    "Галактионова",
    "Федорова",
    "Фролова",
    "Третьякова",
    "Николаева",
    "Софийская",
    "Соболева",
    "Кузнецова",
    "Чайковская",
    "Зайцева",
    "Аверина",
    "Князева",
    "Меркулова",
    "Чернышова",
    "Белокрылова",
    "Дмитриева",
    "Соколович",
    "Ковальчук",
    "Сафронова",
    "Каменская",
    "Романенко",
    "Бондаренко",
    "Вершинина",
    "Соловьева",
    "Голубева",
    "Федосеева",
    "Чехова",
    "Павленко",
    "Меркулова",
    "Кармазина",
    "Канаева",
    "Наварская",
    "Суворова",
    "Рощина",
    "Ленина",
    "Марченко",
    "Дементьева",
    "Архипова",
    "Шорохова",
    "Снежная",
    "Кудрявцева",
    "Дубровская",
    "Минаева",
    "Мечникова",
    "Путина",
    "Богданова",
    "Исаева",
    "Солнцева",
    "Бердинских",
    "Крымская",
    "Швец",
    "Платонова",
    "Пугачева",
    "Тихомирова",
    "Давыдова",
    "Ржевская",
    "Аверина",
    "Добровольская",
    "Садовская",
    "Дроздова",
    "Бородина",
    "Брежнева",
    "Баринова",
    "Доценко",
    "Вишневская",
    "Шевченко",
    "Абрамович",
    "Берестова",
    "Сочинская",
    "Данилова",
    "Радецкая",
    "Репина",
    "Литковская",
    "Владимирова",
    "Михайлова",
    "Шанская",
    "Любимова",
    "Громова",
    "Астахова",
    "Высоцкая",
    "Городецкая",
    "Жукова",
    "Сомова",
    "Звездная",
    "Шаповалова",
    "Галицына",
    "Быстрова",
    "Зорина",
    "Сахарова",
    "Жданова",
    "Редкая",
    "Медведева",
    "Титова",
    "Стацевич",
    "Крылова",
    "Байко",
    "Литвинова",
    "Радионова",
    "Зимина",
    "Булгакова",
    "Ермолаева",
    "Шин",
    "Сидорова",
    "Филлипова",
    "Питерская",
    "Маврина",
    "Альмова",
    "Просветова",
    "Лермонтова",
    "Охотникова",
    "Фомина",
    "Войтова",
    "Богатырева",
    "Царева",
    "Градова",
    "Екимова",
    "Соболь",
    "Осипова",
    "Андрианова",
    "Якубович",
    "Виноградова",
    "Федорчук",
    "Герасименко",
    "Бойцова",
    "Оленникова",
    "Ермилова",
    "Пименова",
    "Дарьянова",
    "Чудина",
    "Лаврентьева",
    "Павловская",
    "Точеная",
    "Снегова",
    "Добронравова",
    "Алтырева",
    "Лазарева",
    "Калашникова",
    "Серебрянникова",
    "Вещая",
    "Чайка",
    "Дружинина",
    "Валинина",
    "Довлатова",
    "Варфоломеева",
    "Кротова",
    "Верховская",
    "Богачева",
    "Золотухина",
    "Милованова",
    "Матвиенко",
    "Казакова",
    "Захарова",
    "Белоусова",
    "Санина",
    "Ерошенко",
    "Лучная",
    "Шпагина",
    "Кутузова",
    "Емельянова",
    "Круглова",
    "Кароль",
    "Баскова",
    "Уланова",
    "Краснова",
    "Железная",
    "Гоголь",
    "Бровина",
    "Румянцева",
    "Подорожная"
  ])

  @doc """
  Returns a random prefix

  ## Examples

      iex> Faker.Name.Ru.Female.prefix()
      "Г-жа."
      iex> Faker.Name.Ru.Female.prefix()
      "Д-р."
  """
  @spec prefix() :: String.t()
  sampler(:prefix, [
    "Г-жа.",
    "Д-р."
  ])
end
