defmodule Faker.Name.Caucasian do
  import Faker, only: [sampler: 2]

  @moduledoc """
  Functions for caucasian names
  """

  @doc """
  Returns a complete name (may include a suffix/prefix or both)

  ## Examples

      iex> Faker.Name.Caucasian.name()
      "Ушат Помоев"
      iex> Faker.Name.Caucasian.name()
      "Руслан Гилаев"
      iex> Faker.Name.Caucasian.name()
      "Подрыв Устоев"
      iex> Faker.Name.Caucasian.name()
      "Поджог Сараев"
  """
  @spec name() :: String.t()
  def name, do: "#{first_name()} #{last_name()}"

  @doc """
  Returns a random first name

  ## Examples

      iex> Faker.Name.Caucasian.first_name()
      "Разрез"
      iex> Faker.Name.Caucasian.first_name()
      "Загон"
      iex> Faker.Name.Caucasian.first_name()
      "Шамиль"
      iex> Faker.Name.Caucasian.first_name()
      "Учет"
  """
  @spec first_name() :: String.t()
  sampler(:first_name, [
    "Солман",
    "Шамиль",
    "Руслан",
    "Ушат",
    "Подрыв",
    "Поджог",
    "Погром",
    "Обвал",
    "Угон",
    "Исход",
    "Захват",
    "Камаз",
    "Развод",
    "Улов",
    "Рулон",
    "Под",
    "Друган",
    "Учет",
    "Разбор",
    "Разгул",
    "Разрез",
    "Запой",
    "Загон",
    "Курган",
    "Удар",
    "Ушат",
    "Улов",
    "Рекорд",
    "Отряд",
    "Подрыв",
    "Погром",
    "Поджог",
    "Захват",
    "Исход",
    "Побег",
    "Обвал",
    "Угон",
    "Удел",
    "Камаз",
    "Развод",
    "Забег",
    "Парад",
    "Отряд",
    "Улов",
    "Рулон",
    "Черёд",
    "Квартет",
    "Подсуд",
    "Друган",
    "Учёт",
    "Налог",
    "Разбор",
    "Мешок",
    "Обед",
    "Карман",
    "Разгул",
    "Прыжок",
    "Рожок",
    "Разрез",
    "Полёт",
    "Удар",
    "Майор",
    "Пробрал",
    "Заплыв",
    "Порвал",
    "Расстрел",
    "Запой",
    "Сачок",
    "Поход",
    "Барак",
    "Загон",
    "Пропой",
    "Отряд",
    "Тридня",
    "Облом",
    "Курган",
    "Полно"
  ])

  @doc """
  Returns a random last name

  ## Examples

      iex> Faker.Name.Caucasian.last_name()
      "Гусаров"
      iex> Faker.Name.Caucasian.last_name()
      "Отбросов"
      iex> Faker.Name.Caucasian.last_name()
      "Забоев"
      iex> Faker.Name.Caucasian.last_name()
      "Радуев"
  """
  @spec last_name() :: String.t()
  sampler(:last_name, [
    "Радуев",
    "Басаев",
    "Гилаев",
    "Помоев",
    "Устоев",
    "Сараев",
    "Евреев",
    "Забоев",
    "Харлеев",
    "Изгоев",
    "Покоев",
    "Отходов",
    "Супругов",
    "Кальмаров",
    "Обоев",
    "шум Прибоев",
    "Братанов",
    "Расходов",
    "Полетов",
    "Гармонов",
    "Батонов",
    "Гусаров",
    "Баранов",
    "Отбросов",
    "Морозов",
    "Помоев",
    "Налимов",
    "Надоев",
    "Ковбоев",
    "Устоев",
    "Евреев",
    "Сараев",
    "Покоев",
    "Изгоев",
    "Злодеев",
    "Забоев",
    "Харлеев",
    "Плебеев",
    "Отходов",
    "Супругов",
    "Дебилов",
    "Уродов",
    "Кретинов",
    "Кальмаров",
    "Обоев",
    "Застоев",
    "Гобоев",
    "Злодеев",
    "Братанов",
    "Расходов",
    "Сдоходов",
    "Полётов",
    "Лимонов",
    "Лемуров",
    "Пистонов",
    "Гормонов",
    "Гиббонов",
    "Патронов",
    "Батонов",
    "Фазанов",
    "Морозов",
    "Допросов",
    "Поносов",
    "Матросов",
    "Баянов",
    "Арабов",
    "Гусаров",
    "Моллюсков",
    "Гераклов",
    "Монголов",
    "Баранов",
    "Погонов",
    "Маньяков",
    "Запоев",
    "Пиндосов",
    "Отбросов",
    "Засосов"
  ])
end
